# 1. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

a = 5
print(f'{a} = {bin(a)}')
b = 6
print(f'{b} = {bin(b)}')

# and
print(f'{a} and {b} = {a & b}, ({bin(a & b)})')

# or
print(f'{a} or {b} = {a | b}, ({bin(a | b)})')

# xor
print(f'{a} xor {b} = {a ^ b}, ({bin(a ^ b)})')

# сдвиг вправо на 2
print(f'{a} >> 2 = {a >> 2}, ({bin(a >> 2)})')

# сдвиг влево на 2
print(f'{a} << 2 = {a << 2}, ({bin(a << 2)})')
